{
  "architectures": [
    "ConvNextForImageClassification"
  ],
  "depths": [
    3,
    3,
    9,
    3
  ],
  "drop_path_rate": 0.0,
  "hidden_act": "gelu",
  "hidden_sizes": [
    96,
    192,
    384,
    768
  ],
  "id2label": {
    "0": "AK",
    "1": "BCC",
    "2": "BKL",
    "3": "DF",
    "4": "MEL",
    "5": "NV",
    "6": "SCC",
    "7": "VASC"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "label2id": {
    "AK": 0,
    "BCC": 1,
    "BKL": 2,
    "DF": 3,
    "MEL": 4,
    "NV": 5,
    "SCC": 6,
    "VASC": 7
  },
  "layer_norm_eps": 1e-12,
  "layer_scale_init_value": 1e-06,
  "model_type": "convnext",
  "num_channels": 3,
  "num_stages": 4,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "patch_size": 4,
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.52.4"
}
